[
  {
    "id": 1,
    "title": "Agence Immobilière Kasa",
    "tags": ["React", "Scss"],
    "cover": "./images/projets/kasa.avif",
    "alt": "Photo de l'intérieur d'une maison, vue sur la table à manger.",
    "description": "Implémentation du front-end en utilisant React et React Router pour créer une expérience utilisateur moderne et réactive. Travail sur la logique de présentation des données et les composants React. Utilisation de React Router pour configurer la navigation entre les différentes pages de l'application.",
    "repo": "https://github.com/JBB777/OCProject7",
    "demo": ""
  },
  {
    "id": 2,
    "title": "Nina Carducci - Photographe",
    "tags": ["Référencement", "Accessibilité"],
    "cover": "./images/projets/ninaCarducci.avif",
    "alt": "Photo de la photographe Nina Carducci.",
    "description": "Mise à jour du site de la photographe Nina Carducci afin d'améliorer les performances, le référencement et l'accessibilité du site suite à l'identification des problèmes de chargement et de référencement.",
    "repo": "https://github.com/JBB777/OCProject8",
    "demo": ""
  },
  {
    "id": 3,
    "title": "Sophie Bluel - Architecte d'intérieur",
    "tags": ["Javascript", "Scss"],
    "cover": "./images/projets/sophieBluel.avif",
    "alt": "Photo de l'architecte Sophie Bluel.",
    "description": "Mise à jour de la partie Front-End du site, où j'ai développé la page de présentation des travaux de l'architecte à partir du HTML fourni. Cela implique la gestion des événements utilisateurs et la manipulation des éléments du DOM avec JavaScript. J'ai également créée une page de connexion pour l'administrateur du site ainsi qu'une modale permettant d'uploader de nouveaux médias. ",
    "repo": "https://github.com/JBB777/OCProject6",
    "demo": ""
  },
  {
    "id": 4,
    "title": "OhMyFood",
    "tags": ["Html", "Css", "Scss", "Animations"],
    "cover": "./images/projets/ohmyfood.avif",
    "alt": "Vue d'un plat dans une assiette, présentée sur une table dans un restaurant gastronomique.",
    "description": "Ma tâche principale a été d'intégrer une maquette en mobile-first. Je disposerais des maquettes pour mobile et desktop, du prototype sur Figma, ainsi que des images et textes nécessaires. Cette approche mobile-first m'a permis de comprendre l'importance de concevoir des sites web adaptatifs et réactifs.",
    "repo": "https://github.com/JBB777/OCProject4",
    "demo": ""
  }
]
